# pandas Quiz-1

(2021.8.17)

아래 문제를 풀어 보세요. map() 이용해 보세요. 
첫 번째 컬럼을 이용하여, fruit, price 컬럼을 생성해 보세요. 
세미콜론으로 분리하여 과일이름은 fruit 컬럼에, 숫자는 price 컬럼, city이름은 city에 넣어주셔요

In [32]:
import pandas as pd
from pandas import DataFrame, Series

df_raw = DataFrame( [['apple;100;Seoul'],['grape;200;Busan']], columns=['total'])
df_raw

             total
0  apple;100;Seoul
1  grape;200;Busan

## (sol 1) basic

In [33]:
df=df_raw.cpy()

AttributeError: 'DataFrame' object has no attribute 'cpy'

In [34]:
def make(x, *, sep=';', no=0):
    x2= x.split(sep)
    return x2[no]

df['fruit'] = df['total'].map(lambda x : make(x, no=0))
df

             total  fruit
0  apple;100;Seoul  apple
1  grape;200;Busan  grape

In [35]:
df['price'] = df['total'].map(lambda x : make(x, no=1))
df

             total  fruit price
0  apple;100;Seoul  apple   100
1  grape;200;Busan  grape   200

In [36]:
df['city'] = df['total'].map(lambda x : make(x, no=2))
df

             total  fruit price   city
0  apple;100;Seoul  apple   100  Seoul
1  grape;200;Busan  grape   200  Busan

## (sol 2) str.split()

In [37]:
df = df_raw
df

             total
0  apple;100;Seoul
1  grape;200;Busan

In [38]:
df[['fruit','price','city']] = df['total'].str.split(';', expand=True)

In [39]:
df

             total  fruit price   city
0  apple;100;Seoul  apple   100  Seoul
1  grape;200;Busan  grape   200  Busan

### (Sol3) apply()

In [40]:
df = df_raw

In [42]:
df[['fruit','price','city']] = df['total'].apply(lambda x: Series(str(x).split(";")) )
df

             total  fruit price   city
0  apple;100;Seoul  apple   100  Seoul
1  grape;200;Busan  grape   200  Busan